Repository: fangjunyu1/SwiftSlim
Catalog: SwiftSlim/Localization/Localizable.xcstrings
Source language: en
Languages: ar, bg, bn, ca, cs, da, de, el, es, fi, fr, gu, he, hi, hr, hu, id, it, ja, kk, kn, ko, lt, ml, mr, ms, nb, nl, or, pa, pl, pt, ro, ru, sk, sl, sv, ta, te, th, tr, uk, ur, vi, zh_hans, zh_hant

# why_this_app3
source: So, this app aims to start from the basics and explain knowledge clearly through real examples and concrete scenarios, helping beginners learn Swift step by step and gradually build the ability to develop apps in the process.
ar: لذلك، يهدف هذا التطبيق إلى الانطلاق من الأساسيات وشرح المعرفة بوضوح من خلال أمثلة عملية ومواقف واقعية، لمساعدة المبتدئين على تعلّم Swift خطوة بخطوة وبناء القدرة على تطوير التطبيقات تدريجيًا أثناء التعلّم.
bg: Затова това приложение има за цел да започне от основите и да обяснява знанията ясно чрез реални примери и конкретни ситуации, като помага на начинаещите да учат Swift стъпка по стъпка и постепенно да изграждат умението да разработват приложения в процеса на обучение.
bn: তাই, এই অ্যাপটি একেবারে ভিত্তি থেকে শুরু করে বাস্তব উদাহরণ ও নির্দিষ্ট প্রয়োগের মাধ্যমে বিষয়গুলো স্পষ্টভাবে বোঝাতে চায়, যাতে নতুনরা ধাপে ধাপে Swift শিখতে পারে এবং শেখার মধ্যেই ধীরে ধীরে অ্যাপ ডেভেলপ করার ক্ষমতা গড়ে তুলতে পারে।
ca: Per això, aquesta app vol començar des dels conceptes bàsics i explicar els coneixements amb claredat a través d’exemples reals i situacions concretes, ajudant els principiants a aprendre Swift pas a pas i a desenvolupar gradualment la capacitat de crear aplicacions durant el procés d’aprenentatge.
cs: Proto si tato aplikace klade za cíl začít od základů a srozumitelně vysvětlovat znalosti prostřednictvím skutečných příkladů a konkrétních situací, aby začátečníkům pomohla učit se Swift krok za krokem a během učení si postupně vybudovat schopnost vyvíjet aplikace.
da: Derfor har denne app til formål at tage udgangspunkt i det grundlæggende og forklare stoffet tydeligt gennem praktiske eksempler og konkrete situationer, så begyndere kan lære Swift trin for trin og gradvist opbygge evnen til at udvikle apps undervejs.
de: Deshalb möchte diese App bei den Grundlagen ansetzen und Wissen anhand praktischer Beispiele und konkreter Szenarien verständlich vermitteln, damit Einsteiger Swift Schritt für Schritt lernen und dabei nach und nach die Fähigkeit aufbauen, Apps zu entwickeln.
el: Γι’ αυτό, αυτή η εφαρμογή θέλει να ξεκινά από τα βασικά και να εξηγεί τη γνώση με σαφήνεια μέσα από πραγματικά παραδείγματα και συγκεκριμένα σενάρια, βοηθώντας τους αρχάριους να μαθαίνουν Swift βήμα προς βήμα και να χτίζουν σταδιακά την ικανότητα ανάπτυξης εφαρμογών κατά τη διάρκεια της μάθησης.
es: Por eso, esta app quiere partir de lo básico y explicar el conocimiento con claridad a través de ejemplos reales y situaciones concretas, ayudando a los principiantes a aprender Swift paso a paso y a desarrollar poco a poco la capacidad de crear aplicaciones durante el aprendizaje.
fi: Siksi tämän sovelluksen tavoitteena on lähteä liikkeelle perusteista ja selittää asiat selkeästi todellisten esimerkkien ja konkreettisten tilanteiden kautta, jotta aloittelijat voivat oppia Swiftiä askel askeleelta ja vähitellen rakentaa sovelluskehityksen taitojaan oppimisen aikana.
fr: Ainsi, cette app cherche à partir des bases et à expliquer clairement les connaissances à travers des exemples concrets et des situations réelles, afin d’aider les débutants à apprendre Swift pas à pas et à développer progressivement leur capacité à créer des applications au fil de l’apprentissage.
gu: આ કારણે, આ એપ મૂળભૂત બાબતોથી શરૂઆત કરીને વાસ્તવિક ઉદાહરણો અને ચોક્કસ પરિસ્થિતિઓ દ્વારા જ્ઞાનને સ્પષ્ટ રીતે સમજાવવા માંગે છે, જેથી શરૂઆત કરનારાઓ Swift ને પગલુંદર પગલું શીખી શકે અને શીખવાની પ્રક્રિયામાં ધીમે ધીમે એપ્લિકેશન વિકસાવવાની ક્ષમતા ઉભી કરી શકે.
he: לכן, האפליקציה הזו שואפת להתחיל מהבסיס ולהסביר את הידע בצורה ברורה באמצעות דוגמאות מעשיות ומצבים קונקרטיים, כדי לעזור למתחילים ללמוד Swift צעד אחר צעד ולבנות בהדרגה את היכולת לפתח אפליקציות תוך כדי הלמידה.
hi: इसलिए, यह ऐप बुनियाद से शुरुआत करते हुए वास्तविक उदाहरणों और ठोस परिस्थितियों के माध्यम से ज्ञान को स्पष्ट रूप से समझाना चाहता है, ताकि शुरुआती लोग चरण-दर-चरण Swift सीख सकें और सीखने की प्रक्रिया में धीरे-धीरे ऐप विकसित करने की क्षमता बना सकें।
hr: Zato ova aplikacija želi krenuti od osnova i jasno objasniti znanje kroz stvarne primjere i konkretne situacije, pomažući početnicima da korak po korak uče Swift i postupno izgrade sposobnost razvoja aplikacija tijekom učenja.
hu: Ezért ez az alkalmazás az alapoktól szeretne indulni, és valós példákon, valamint konkrét helyzeteken keresztül érthetően bemutatni az ismereteket, segítve a kezdőket abban, hogy lépésről lépésre tanulják meg a Swiftet, és a tanulás során fokozatosan kialakítsák az alkalmazásfejlesztéshez szükséges képességeiket.
id: Karena itu, aplikasi ini ingin berangkat dari dasar dan menjelaskan pengetahuan dengan jelas melalui contoh nyata dan situasi konkret, membantu pemula belajar Swift langkah demi langkah serta secara bertahap membangun kemampuan mengembangkan aplikasi selama proses belajar.
it: Per questo, questa app vuole partire dalle basi e spiegare i concetti in modo chiaro attraverso esempi pratici e situazioni concrete, aiutando i principianti a imparare Swift passo dopo passo e a sviluppare gradualmente la capacità di creare app durante il percorso di apprendimento.
ja: そのため、このアプリは基礎から出発し、実際の例や具体的な場面を通して内容をわかりやすく伝えることで、初学者がSwiftを一歩ずつ学びながら、学習の中で少しずつアプリ開発の力を身につけられるようにすることを目指しています。
kk: Сондықтан бұл қолданба негіздерден бастап, нақты мысалдар мен айқын жағдайлар арқылы білімді түсінікті етіп жеткізуді мақсат етеді. Бұл жаңадан бастаушыларға Swift-ті қадам-қадаммен үйренуге және оқу барысында қолданба әзірлеу қабілетін біртіндеп қалыптастыруға көмектеседі.
kn: ಆದ್ದರಿಂದ, ಈ ಆಪ್ ಮೂಲಭೂತಗಳಿಂದ ಆರಂಭಿಸಿ ನೈಜ ಉದಾಹರಣೆಗಳು ಮತ್ತು ಸ್ಪಷ್ಟ ಸಂದರ್ಭಗಳ ಮೂಲಕ ವಿಷಯಗಳನ್ನು ಸುಲಭವಾಗಿ ವಿವರಿಸಲು ಉದ್ದೇಶಿಸಿದೆ. ಇದರಿಂದ ಆರಂಭಿಕರು ಹಂತ ಹಂತವಾಗಿ Swift ಅನ್ನು ಕಲಿಯಲು ಮತ್ತು ಕಲಿಕೆಯ ಪ್ರಕ್ರಿಯೆಯಲ್ಲೇ ಕ್ರಮೇಣ ಆಪ್ ಅಭಿವೃದ್ಧಿ ಮಾಡುವ ಸಾಮರ್ಥ್ಯವನ್ನು ನಿರ್ಮಿಸಿಕೊಳ್ಳಲು ಸಹಾಯವಾಗುತ್ತದೆ.
ko: 그래서 이 앱은 기초부터 출발해 실제 예시와 구체적인 상황을 통해 내용을 쉽게 설명하고, 초보자가 Swift를 한 걸음씩 배워 나가면서 학습 과정 속에서 점차 앱 개발 능력을 키울 수 있도록 돕고자 합니다.
lt: Todėl ši programėlė siekia pradėti nuo pagrindų ir aiškiai paaiškinti žinias per realius pavyzdžius bei konkrečias situacijas, padėdama pradedantiesiems žingsnis po žingsnio mokytis Swift ir mokymosi procese palaipsniui ugdytis gebėjimą kurti programėles.
ml: അതുകൊണ്ട്, ഈ ആപ്പ് അടിസ്ഥാനങ്ങളിൽ നിന്ന് ആരംഭിച്ച് യഥാർത്ഥ ഉദാഹരണങ്ങളുടെയും വ്യക്തമായ സാഹചര്യങ്ങളുടെയും միջոցով അറിവ് വ്യക്തമായി വിശദീകരിക്കാൻ ലക്ഷ്യമിടുന്നു. ഇതിലൂടെ തുടക്കക്കാരെ ഘട്ടം ഘട്ടമായി Swift പഠിക്കാനും പഠനത്തിനിടെ ക്രമേണ ആപ്പുകൾ വികസിപ്പിക്കുന്ന കഴിവ് രൂപപ്പെടുത്താനും സഹായിക്കാനാണ് ശ്രമം.
mr: म्हणूनच, हे अॅप मूलभूत गोष्टींपासून सुरुवात करून प्रत्यक्ष उदाहरणे आणि ठोस प्रसंगांच्या माध्यमातून ज्ञान स्पष्टपणे समजावून सांगण्याचा प्रयत्न करते, ज्यामुळे नवशिके टप्प्याटप्प्याने Swift शिकू शकतील आणि शिकत असतानाच हळूहळू अॅप विकसित करण्याची क्षमता निर्माण करू शकतील.
ms: Oleh itu, aplikasi ini ingin bermula daripada asas dan menerangkan pengetahuan dengan jelas melalui contoh sebenar serta situasi yang konkret, membantu pemula mempelajari Swift langkah demi langkah dan secara beransur-ansur membina keupayaan untuk membangunkan aplikasi sepanjang proses pembelajaran.
nb: Derfor ønsker denne appen å starte med det grunnleggende og forklare kunnskap tydelig gjennom praktiske eksempler og konkrete situasjoner, slik at nybegynnere kan lære Swift steg for steg og gradvis bygge opp evnen til å utvikle apper mens de lærer.
nl: Daarom wil deze app vanuit de basis beginnen en kennis duidelijk uitleggen aan de hand van echte voorbeelden en concrete situaties, zodat beginners stap voor stap Swift kunnen leren en tijdens het leerproces geleidelijk het vermogen kunnen opbouwen om apps te ontwikkelen.
or: ସେହିପାଇଁ, ଏହି ଆପ୍ ମୂଳଭିତ୍ତିରୁ ଆରମ୍ଭ କରି, ପ୍ରାକ୍ତିକ ଉଦାହରଣ ଏବଂ ସ୍ପଷ୍ଟ ପରିସ୍ଥିତି ମାଧ୍ୟମରେ ଜ୍ଞାନକୁ ସହଜରେ ବୁଝାଇବାକୁ ଚାହେ, ଯାହାର ଫଳରେ ନବଶିକ୍ଷୁମାନେ ପଦେ ପଦେ Swift ଶିଖିପାରିବେ ଏବଂ ଶିକ୍ଷା ପ୍ରକ୍ରିୟାରେ ଧୀରେ ଧୀରେ ଆପ୍ ବିକାଶ କରିବାର କ୍ଷମତା ଗଢ଼ିଉଠିବ।
pa: ਇਸ ਲਈ, ਇਹ ਐਪ ਬੁਨਿਆਦ ਤੋਂ ਸ਼ੁਰੂ ਕਰਕੇ ਅਸਲ ਉਦਾਹਰਣਾਂ ਅਤੇ ਠੋਸ ਸਥਿਤੀਆਂ ਰਾਹੀਂ ਗਿਆਨ ਨੂੰ ਸਪੱਸ਼ਟ ਤਰੀਕੇ ਨਾਲ ਸਮਝਾਉਣ ਦੀ ਕੋਸ਼ਿਸ਼ ਕਰਦੀ ਹੈ, ਤਾਂ ਜੋ ਸ਼ੁਰੂਆਤੀ ਸਿਖਿਆਰਥੀ ਕਦਮ-ਦਰ-ਕਦਮ Swift ਸਿੱਖ ਸਕਣ ਅਤੇ ਸਿੱਖਣ ਦੀ ਪ੍ਰਕਿਰਿਆ ਵਿੱਚ ਹੌਲੀ-ਹੌਲੀ ਐਪ ਵਿਕਸਿਤ ਕਰਨ ਦੀ ਸਮਰੱਥਾ ਬਣਾਉਣ ਲੱਗਣ।
pl: Dlatego ta aplikacja chce wychodzić od podstaw i jasno wyjaśniać wiedzę poprzez praktyczne przykłady oraz konkretne sytuacje, pomagając początkującym uczyć się Swifta krok po kroku i stopniowo budować umiejętność tworzenia aplikacji w trakcie nauki.
pt: Por isso, este app procura partir do básico e explicar o conhecimento com clareza por meio de exemplos práticos e situações concretas, ajudando iniciantes a aprender Swift passo a passo e a desenvolver gradualmente a capacidade de criar aplicativos ao longo do aprendizado.
ro: De aceea, această aplicație își propune să pornească de la bază și să explice clar cunoștințele prin exemple practice și situații concrete, ajutând începătorii să învețe Swift pas cu pas și să își dezvolte treptat capacitatea de a crea aplicații pe parcursul învățării.
ru: Поэтому это приложение стремится начинать с основ и понятно объяснять материал через практические примеры и конкретные сценарии, помогая новичкам шаг за шагом изучать Swift и постепенно формировать способность разрабатывать приложения в процессе обучения.
sk: Preto chce táto aplikácia vychádzať zo základov a jasne vysvetľovať poznatky prostredníctvom praktických príkladov a konkrétnych situácií, aby začiatočníkom pomohla učiť sa Swift krok za krokom a postupne si počas učenia budovať schopnosť vyvíjať aplikácie.
sl: Zato želi ta aplikacija začeti pri osnovah in znanje jasno razložiti s pomočjo praktičnih primerov ter konkretnih situacij, da bi začetnikom pomagala korak za korakom spoznavati Swift in med učenjem postopoma razvijati sposobnost ustvarjanja aplikacij.
sv: Därför vill den här appen börja från grunderna och förklara kunskap tydligt genom verkliga exempel och konkreta situationer, så att nybörjare kan lära sig Swift steg för steg och gradvis bygga upp förmågan att utveckla appar under inlärningen.
ta: அதனால், இந்த ஆப் அடிப்படைகளில் இருந்து தொடங்கி, நடைமுறை எடுத்துக்காட்டுகளும் தெளிவான சூழல்களும் மூலம் அறிவை எளிதாக விளக்க விரும்புகிறது; இதன் மூலம் தொடக்கநிலையிலுள்ளவர்கள் படிப்படியாக Swift கற்றுக்கொண்டு, கற்றலின் போக்கில் மெல்லமெல்ல ஆப்புகளை உருவாக்கும் திறனை வளர்த்துக்கொள்ளலாம்.
te: అందుకే, ఈ యాప్ ప్రాథమిక అంశాల నుంచే ప్రారంభించి, నిజమైన ఉదాహరణలు మరియు స్పష్టమైన సందర్భాల ద్వారా విషయాలను సులభంగా వివరించాలని లక్ష్యంగా పెట్టుకుంది. దీని ద్వారా ప్రారంభికులు దశలవారీగా Swift నేర్చుకుంటూ, నేర్చుకునే ప్రక్రియలోనే క్రమంగా యాప్‌లను అభివృద్ధి చేసే సామర్థ్యాన్ని పెంపొందించుకోవచ్చు.
th: ดังนั้น แอปนี้จึงตั้งใจเริ่มต้นจากพื้นฐาน และอธิบายความรู้ให้ชัดเจนผ่านตัวอย่างจริงและสถานการณ์ที่เป็นรูปธรรม เพื่อช่วยให้ผู้เริ่มต้นเรียนรู้ Swift ไปทีละขั้น และค่อย ๆ สร้างความสามารถในการพัฒนาแอประหว่างการเรียนรู้
tr: Bu nedenle bu uygulama, temelden başlayarak bilgiyi gerçek örnekler ve somut senaryolar üzerinden açık biçimde anlatmayı amaçlıyor; böylece yeni başlayanlar Swift’i adım adım öğrenirken süreç içinde uygulama geliştirme becerisini de kademeli olarak kazanabiliyor.
uk: Тому цей застосунок прагне починати з основ і зрозуміло пояснювати знання через практичні приклади та конкретні ситуації, допомагаючи початківцям крок за кроком вивчати Swift і поступово формувати здатність розробляти застосунки в процесі навчання.
ur: اسی لیے یہ ایپ بنیادی چیزوں سے آغاز کرتے ہوئے عملی مثالوں اور واضح حالات کے ذریعے علم کو صاف انداز میں سمجھانے کی کوشش کرتی ہے، تاکہ ابتدائی سیکھنے والے مرحلہ وار Swift سیکھ سکیں اور سیکھنے کے دوران آہستہ آہستہ ایپس تیار کرنے کی صلاحیت بھی پیدا کر سکیں۔
vi: Vì vậy, ứng dụng này muốn bắt đầu từ những nền tảng cơ bản và giải thích kiến thức một cách rõ ràng thông qua các ví dụ thực tế và tình huống cụ thể, giúp người mới học Swift từng bước và dần xây dựng khả năng phát triển ứng dụng ngay trong quá trình học.
zh_hans: 所以，这款 App 希望从基础出发，通过实际案例和具体场景把知识讲清楚，帮助初学者一步步学习 Swift，并在学习中逐渐建立起开发应用的能力。
zh_hant: 所以，這款 App 希望從基礎出發，透過實際案例和具體情境把知識講清楚，幫助初學者一步步學習 Swift，並在學習中逐漸建立起開發應用的能力。

source: Xcode Shortcuts
ar: اختصارات Xcode
bg: Xcode преки пътища
bn: Xcode শর্টকাট
ca: Dreceres Xcode
cs: Zkratky Xcode
da: Xcode-genveje
el: Συντομεύσεις Xcode
es: Atajos Xcode
fi: Xcode-oikotiet
fr: Raccourcis Xcode
gu: Xcode શોર્ટકટ
he: קיצורי Xcode
hi: Xcode शॉर्टकट
hr: Xcode prečaci
hu: Xcode gyorsbill.
id: Shortcut Xcode
it: Scorciatoie Xcode
ja: Xcodeショートカット
kk: Xcode төте жолдары
kn: Xcode ಶಾರ್ಟ್‌ಕಟ್
ko: Xcode 단축키
lt: Xcode spartieji kl.
ml: Xcode ഷോർട്ട്കട്ട്
mr: Xcode शॉर्टकट
ms: Pintasan Xcode
nb: Xcode-snarveier
nl: Xcode-sneltoetsen
or: Xcode ଶର୍ଟକଟ୍
pa: Xcode ਸ਼ਾਰਟਕੱਟ
pl: Skróty Xcode
pt: Atalhos Xcode
ro: Scurtături Xcode
ru: Горячие кл. Xcode
sk: Skratky Xcode
sl: Bližnjice Xcode
sv: Xcode-genvägar
ta: Xcode குறுக்குவழிகள்
te: Xcode షార్ట్‌కట్‌లు
th: คีย์ลัด Xcode
tr: Xcode Kısayolları
uk: Скорочення Xcode
ur: Xcode شارٹ کٹس
vi: Phím tắt Xcode
zh_hans: Xcode 快捷键
zh_hant: Xcode 快捷鍵

source: Angular Gradient
zh_hans: 角度渐变

source: Angular gradient rotates colors around a center point.
zh_hans: 角度渐变是围绕某个点旋转的渐变效果，适合用于圆形或圆弧区域。

source: Animation Curves
zh_hans: 动画曲线

source: Animation Preview
zh_hans: 动画效果预览

source: API Reference
zh_hans: 接口速查手册

source: App accent color, default blue
zh_hans: App 的强调色，默认蓝色

source: Bounce
zh_hans: 弹性（Bounce）

source: Bounce effect with overshoot and return
zh_hans: 带有弹跳效果，超出目标后回弹

source: ColorPicker
zh_hans: 颜色选择
zh_hant: 顏色選擇

source: Colors
zh_hans: 颜色参考

source: Common Fixes
zh_hans: 常见错误解决

source: Custom Spring Animation
zh_hans: 自定义弹簧动画

source: DatePicker
zh_hans: 日期选择
zh_hant: 日期選擇

source: DisclosureGroup
zh_hans: 折叠组
zh_hant: 折疊群組

source: Duration
zh_hans: 持续时间（Duration）

source: Errors
zh_hans: 报错库

source: Fang Junyu
zh_hans: 方君宇
zh_hant: 方君宇

source: Fast response with slight springy finish
zh_hans: 快速响应，迅速到位后轻微弹性收尾

source: Form
zh_hans: 表单
zh_hant: 表單

source: Gradient Colors
zh_hans: 渐变颜色

source: Gradually accelerates from slow to fast
zh_hans: 由慢到快，开始缓慢加速

source: Gradually decelerates from fast to slow
zh_hans: 由快到慢，结尾逐渐减速

source: Linear animation with constant speed throughout
zh_hans: 匀速动画，全程速度保持恒定

source: Linear Gradient
zh_hans: 线性渐变

source: Linear gradient transitions between colors along a direction.
zh_hans: 线性渐变会在指定的方向上从一个颜色过渡到另一个颜色。

source: List
zh_hans: 列表
zh_hant: 列表

source: Menu Picker
zh_hans: 菜单选择
zh_hant: 選單選擇

source: NavigationLink
zh_hans: 页面跳转
zh_hant: 頁面跳轉

source: Physics-based spring interpolation with precise control parameters
zh_hans: 基于物理插值的弹簧，精确控制参数

source: Play All Comparisons
zh_hans: 全部播放对比

source: Playing...
zh_hans: 播放中...

source: Preview Effect
zh_hans: 预览效果

source: Primary text color, adapts to light and dark modes
zh_hans: 主要文本颜色，自动适应深浅模式

source: Radial Gradient
zh_hans: 径向渐变

source: Radial gradient expands outward from a center point.
zh_hans: 径向渐变是从中心向外扩展的渐变效果，适合用于圆形或有中心点的渐变效果。

source: ScrollView
zh_hans: 滚动视图
zh_hant: 捲動視圖

source: Secondary text for supporting information
zh_hans: 次要文本，用于补充信息

source: Section
zh_hans: 分组
zh_hant: 區段

source: SecureField
zh_hans: 密码输入
zh_hant: 密碼輸入

source: Segmented Picker
zh_hans: 分段选择
zh_hant: 分段選擇

source: Semantic Colors
zh_hans: 语义颜色

source: Slider
zh_hans: 滑块
zh_hant: 滑桿

source: Smooth transition with acceleration then deceleration
zh_hans: 先加速后减速，两端平滑过渡

source: Smoother than easeInOut, more natural feel
zh_hans: 平滑曲线，比 easeInOut 更柔和自然

source: Spring animation with natural physical elasticity
zh_hans: 弹簧动画，自然物理感弹性过渡

source: Spring tuned for gestures, more responsive
zh_hans: 适合手势驱动的弹簧，响应更灵敏

source: Stepper
zh_hans: 步进器
zh_hant: 步進器

source: System & Semantic
zh_hans: 系统与语义色

source: System Colors
zh_hans: 系统颜色

source: System default curve, typically easeInOut
zh_hans: 系统默认曲线，通常为 easeInOut 效果

source: TabView
zh_hans: 标签页
zh_hant: 分頁視圖

source: TextEditor
zh_hans: 多行输入
zh_hant: 多行輸入

source: TextField
zh_hans: 单行输入
zh_hant: 單行輸入

source: Toggle
zh_hans: 开关
zh_hant: 開關

source: Wheel Picker
zh_hans: 滚轮选择
zh_hant: 滾輪選擇
